
&НаКлиенте
Процедура ПодобратьУчастниковРабочейГруппы(Команда)
	
	РаботаСАдреснойКнигойКлиент.ПодобратьУчастниковРабочейГруппы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Если ВидДокумента.Пустая() Тогда
		ПоказатьПредупреждение(,"Сначала выберите вид документа!");
		Возврат;
	КонецЕсли;
	
	Если РабочаяГруппаТаблица.Количество() = 0  Тогда
		ПоказатьПредупреждение(,"Выбрите участников рабочей группы!");
		Возврат;
	КонецЕсли;
	
	ДобавитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере()
	
	ТЗУчастников = РеквизитФормыВЗначение("РабочаяГруппаТаблица");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутренниеДокументы.Ссылка
	|ИЗ
	|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
	|ГДЕ
	|	ВнутренниеДокументы.ВидДокумента = &ВидДокумента
	|	И ВнутренниеДокументы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Для Каждого Стр Из ТЗУчастников Цикл
			МенеджерРабочейГруппы = РегистрыСведений.РабочиеГруппы.СоздатьМенеджерЗаписи();
			МенеджерРабочейГруппы.Объект = ВыборкаДетальныеЗаписи.Ссылка;
			МенеджерРабочейГруппы.Участник = Стр.Участник;
			МенеджерРабочейГруппы.Изменение = Стр.Изменение;
			
			МенеджерРабочейГруппы.Записать(Истина);
		КонецЦикла;
		
		ДокументооборотПраваДоступа.ОпределитьДескрипторыОбъекта(ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	ВидДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДокументаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутренниеДокументы.Ссылка КАК Ссылка,
	|	ВнутренниеДокументы.Подготовил,
	|	ВнутренниеДокументы.Создал,
	|	ВнутренниеДокументы.Шаблон
	|ИЗ
	|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
	|ГДЕ
	|	ВнутренниеДокументы.ВидДокумента = &ВидДокумента
	|	И ВнутренниеДокументы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаДокументовДляИзменения = ДокументыДляИзенения.Добавить();
		СтрокаДокументовДляИзменения.Ссылка =ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаДокументовДляИзменения.Подготовил =ВыборкаДетальныеЗаписи.Подготовил;
		СтрокаДокументовДляИзменения.Создал =ВыборкаДетальныеЗаписи.Создал;
		СтрокаДокументовДляИзменения.Шаблон =ВыборкаДетальныеЗаписи.Шаблон;
	КонецЦикла;
	
КонецПроцедуры


// Добавляет участников из шаблона в таблицу.
//
&НаСервере
Процедура ДобавитьУчастниковИзШаблонаВТаблицу(ШаблонДокумента,ТаблицаУчастников, ДокументОбъект)
	
	Для Каждого РабочаяГруппаСтрока Из ШаблонДокумента.РабочаяГруппаДокумента Цикл
		
		Если Не ЗначениеЗаполнено(РабочаяГруппаСтрока.Участник) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(РабочаяГруппаСтрока.Участник) = Тип("Строка") Тогда
			
			ЗначениеАвтоподстановки = ШаблоныДокументов.ПолучитьЗначениеАвтоподстановки(
			РабочаяГруппаСтрока.Участник,
			ДокументОбъект);
			
			Если ЗначениеАвтоподстановки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ЗначениеАвтоподстановки) = Тип("СправочникСсылка.Пользователи")
				Или ТипЗнч(ЗначениеАвтоподстановки) = Тип("СправочникСсылка.РабочиеГруппы")
				Или ТипЗнч(ЗначениеАвтоподстановки) = Тип("СправочникСсылка.СтруктураПредприятия")
				Или ТипЗнч(ЗначениеАвтоподстановки) = Тип("СправочникСсылка.ПолныеРоли") Тогда
				
				ДобавитьУчастникаВТаблицуНабора(ТаблицаУчастников,
				ЗначениеАвтоподстановки,
				РабочаяГруппаСтрока.Изменение);
				
			ИначеЕсли ТипЗнч(ЗначениеАвтоподстановки) = Тип("Структура") Тогда
				
				ДобавитьУчастникаВТаблицуНабора(ТаблицаУчастников, 
				ЗначениеАвтоподстановки.РольИсполнителя,
				РабочаяГруппаСтрока.Изменение);
				
			ИначеЕсли ТипЗнч(ЗначениеАвтоподстановки) = Тип("Массив") Тогда 
				
				Для Каждого ЗначениеАвтоподстановкиЭлемент Из ЗначениеАвтоподстановки Цикл
					
					Если ТипЗнч(ЗначениеАвтоподстановкиЭлемент) = Тип("СправочникСсылка.Пользователи")
						Или ТипЗнч(ЗначениеАвтоподстановкиЭлемент) = Тип("СправочникСсылка.РабочиеГруппы")
						Или ТипЗнч(ЗначениеАвтоподстановкиЭлемент) = Тип("СправочникСсылка.СтруктураПредприятия")
						Или ТипЗнч(ЗначениеАвтоподстановкиЭлемент) = Тип("СправочникСсылка.ПолныеРоли") Тогда 
						
						ДобавитьУчастникаВТаблицуНабора(ТаблицаУчастников,
						ЗначениеАвтоподстановкиЭлемент,
						РабочаяГруппаСтрока.Изменение);
						
					ИначеЕсли ТипЗнч(ЗначениеАвтоподстановкиЭлемент) = Тип("Структура") Тогда 
						
						ДобавитьУчастникаВТаблицуНабора(ТаблицаУчастников, 
						ЗначениеАвтоподстановкиЭлемент.РольИсполнителя,
						РабочаяГруппаСтрока.Изменение);
						
					Иначе
						ВызватьИсключение НСтр("ru = 'Функция автоподстановки вернула некорректное значение участника рабочей группы.'");
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				ВызватьИсключение НСтр("ru = 'Функция автоподстановки вернула некорректное значение участника рабочей группы.'");
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(РабочаяГруппаСтрока.Участник) = Тип("СправочникСсылка.Пользователи")
			Или ТипЗнч(РабочаяГруппаСтрока.Участник) = Тип("СправочникСсылка.СтруктураПредприятия")
			Или ТипЗнч(РабочаяГруппаСтрока.Участник) = Тип("СправочникСсылка.РабочиеГруппы") Тогда
			
			ДобавитьУчастникаВТаблицуНабора(ТаблицаУчастников,
			РабочаяГруппаСтрока.Участник,
			РабочаяГруппаСтрока.Изменение);
			
		ИначеЕсли ТипЗнч(РабочаяГруппаСтрока.Участник) = Тип("СправочникСсылка.ПолныеРоли") Тогда
			
			ДобавитьУчастникаВТаблицуНабора(
			ТаблицаУчастников,
			РабочаяГруппаСтрока.Участник,
			РабочаяГруппаСтрока.Изменение);
			
		Иначе
			ВызватьИсключение НСтр("ru = 'В шаблоне некорректно задан участник рабочей группы.'");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


// Добавляет участника в переданную таблицу.
// Параметр СтрокаДобавленаАвтоматически определяет признак того, что нужно скорректировать
//  реквизит "Изменение" в соответсвии со стандартными правами.
// 
&НаСервере
Процедура ДобавитьУчастникаВТаблицуНабора(
	ТаблицаНабора,
	Участник,
	Изменение = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Участник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПользователиДокументооборот.ЭтоКонтейнер(Участник) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Участник", Участник);
	Отбор.Вставить("Изменение", Изменение);
	
	Если ТаблицаНабора.НайтиСтроки(Отбор).Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = ТаблицаНабора.Добавить();
	СтрокаТаблицы.Участник = Участник;
	СтрокаТаблицы.Изменение = Изменение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуДокументаНаСервере()
	// Формируем таблицу участников рабочей группы с учетом автоподстановок
	Для каждого СтрокаТЧ Из ДокументыДляИзенения Цикл
		ШаблонДокумента =СтрокаТЧ.Ссылка.Шаблон;
		ДокументОбъект = СтрокаТЧ.Ссылка.ПолучитьОбъект();
		ТаблицаУчастников = РегистрыСведений.РабочиеГруппы.ПолучитьПустуюТаблицуУчастников();
		ДобавитьУчастниковИзШаблонаВТаблицу(ШаблонДокумента, ТаблицаУчастников, ДокументОбъект);
		РаботаСРабочимиГруппами.ДобавитьУчастниковВРабочуюГруппуОбъекта(СтрокаТЧ.Ссылка,ТаблицаУчастников,Истина);
	Если Отладка Тогда
		Прервать;
	КонецЕсли; 	
	КонецЦикла; 
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуДокумента(Команда)
	ЗаполнитьПоШаблонуДокументаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
 Сообщить ("Привет!")	// Вставить содержимое обработчика.
КонецПроцедуры
